{"basics":{"Name":"Melike Berksöz","Email":"mberksoz@sabanciuniv.edu","Languages":"Turkish (native), English (Fluent), German (Intermediate)","Address":"Sabanci University, Faculty of Engineering and Natural Sciences, İstanbul"},"education":[{"institution":"Middle East Technical University","area":"Chemistry","studyType":"BSc","endDate":"2010"},{"institution":"Albert Ludwigs University of Freiburg","area":"Chemistry","studyType":"MSc","endDate":"2014"},{"institution":"Sabanci University","area":"Molecular Biology and Bioengineering","studyType":"PhD","endDate":"2024"}],"research_experience":[{"name":"Sabanci University, Multiscale Interactions and Dynamical Systems (MIDST) lab ","position":"Doctoral Researcher","startDate":"2018","endDate":"2024","summary":["Investigated the allosteric regulation of fluorescence in protein-based biosensors with classical and enhanced molecular dynamics simulations - supervised by Prof. Canan Atilgan","Performed Perturbation Response Scanning (PRS) to identify allosteric sites most suitable for insertion of reporter domains.","Employed Alphafold2 with a focus on obtaining alternative conformations.","Designed and ranked binding site and allosteric mutants in terms of ligand affinity using steered-MD simulations. Results are complemented by wet-lab experiments."]},{"name":" İlko Pharmaceuticals, Teknopark İstanbul ","position":"Research Scientist","startDate":"2016","endDate":"2021","summary":["Worked as an industrial PhD candidate in collaboration with Sabanci University on development of anti-cancer antibodies.","Developed liquid chromatography-mass spectrometry methods for characterization of therapeutic antibodies from mammalian expression systems; identified post-translational modifications including glycans, charge variants, disulfide shuffling, aggregation and stability.","Involved in tech transfer from South Korean partner company Genexine."]},{"name":"Albert Ludwigs University of Freiburg","position":"Research Assistant","startDate":"2014","endDate":"2015","summary":["Worked as a Master's student in the group of Prof. Susana Andrade.","Purified the ammonium transporter Amt1 and performed electrophysiology and Cryo-TEM to quantify the electrogenic ion current per monomer."]}]}